using System.Text;
using OpenAI.ObjectModels.RequestModels;

namespace Trainer.Verification.ChatBot.Messages;

public class AssessmentMessageFactory
{
    //Класс для создания сообщения к системе для получения критериев решения
    public static ChatMessage Create()
    {
        var message = new StringBuilder()
            .Append(
                "Оцените кодовое решение для упражнения по этим шести критериям от 1 до 10: удобочитаемость, сложность, креативность, эффективность, структура, логика. Вот что означает каждый из критериев:")
            .AppendLine(
                "удобочитаемость: Этот критерий оценивает, насколько прост код для чтения и понимания. Удобочитаемость связана с использованием понятных и информативных имен переменных (camelCase, snake_case и т.д.) и функций, хорошего форматирования кода (отступы, пробелы, переносы строк) и комментариев, объясняющих, что делает каждая часть кода;")
            .AppendLine(
                "сложность: этот критерий отвечает за то, насколько сложно написан код, возможно, удалось сократить какую-то часть кода, преобразовать несколько строк в одну. (чем выше оценка, тем проще написан код)")
            .AppendLine(
                "креативность: этот критерий оценивает способность пользователя решать проблему, используя нестандартные или изобретательские подходы. Он включает в себя способность применять творческие методы решения, а также использовать различные шаблоны программирования")
            .AppendLine(
                "эффективность: этот критерий относится к тому, насколько хорошо и быстро выполняется код. Это включает в себя использование оптимальных алгоритмов и структур данных для достижения цели, минимизацию времени выполнения и использования ресурсов (таких как память или процессорное время)")
            .AppendLine(
                "структура: Этот критерий оценивает организацию и структуру кода. Это включает в себя использование модульности и разделение кода на логические блоки, соблюдение СУХИХ (не повторяйтесь) принципов и наличие четкого плана или алгоритма решения задачи;")
            .AppendLine(
                "логика: этот критерий оценивает логическую согласованность и корректность алгоритмов и решений. Он учитывает корректность логических операций, обработку исключений, проверку условий и общую логику выполнения программы");
        return ChatMessage.FromSystem(message.ToString());
    }
}